name: "facial_point_net"
layer {
  name: "facial_point"
  type: "NewFacialPointData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  
  new_facial_point_data_param {
    source: "train_aug_list.txt"
    batch_size: 64
    new_height: 224
    new_width: 224
    is_color: true
    shuffle: true
    point_num: 68
    ext_scale: 1.2
    xy_mean: 0.03
    xy_std: 0.03
    wh_mean: 1.0
    wh_std: 0.03
  }
}

layer {
  name: "facial_point"
  type: "NewFacialPointData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
  }
  new_facial_point_data_param {
    source: "test_list.txt"
    batch_size: 64
    new_height: 224
    new_width: 224
    is_color: true
    point_num: 68
    ext_scale: 1.2
    xy_mean: 0.03
    xy_std: 0.03
    wh_mean: 1.0
    wh_std: 0.03
  }
}

## global layer

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
#    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
#    pad: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv5"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool3"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "68point"
  type: "InnerProduct"
  bottom: "fc7"
  top: "68point"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 136
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "68point"
  bottom: "label"
  #loss_weight:10
  top: "loss"
}

layer {
  name: "loc_reg_"
  type: "InnerProduct"
  bottom: "68point"
  top: "theta"

  inner_product_param {
    num_output: 4
    weight_filler {
      type: "constant"
      value: 0
    }
    bias_filler {
      type: "file"
      file: "bias_crop_init.txt"
    }
  }
}

layer {
  name: "theta_loss"
  type: "LocLoss"
  bottom: "theta"
  top: "theta_loss"
  loc_loss_param {
    threshold: 1
  }
  loss_weight: 1
}

# tranform landmarks based on theta
layer {
  name: "st_pts"
  type: "PointTransformer"
  bottom: "label"
  bottom: "theta"
  top: "local/label"
  pt_param {
                transform_type: CROP
		in_width: 224
		in_height: 224
		out_width: 224
		out_height: 224
   }
  propagate_down: false
  propagate_down: false
}

# transform data based on theta
layer {
  name: "st_layer"
  type: "SpatialTransformer"
  bottom: "data"
  bottom: "theta"
  top: "local/data"
  st_param {
      to_compute_dU: false
      output_H: 224
      output_W: 224
      theta_1_2: 0
      theta_2_1: 0
    }
}


## local layer 1
layer {
  name: "local_conv1"
  type: "Convolution"
  bottom: "local/data"
  top: "local/conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
#    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "local_relu1"
  type: "ReLU"
  bottom: "local/conv1"
  top: "local/conv1"
}
layer {
  name: "local_norm1"
  type: "LRN"
  bottom: "local/conv1"
  top: "local/norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  name: "local_pool1"
  type: "Pooling"
  bottom: "local/norm1"
  top: "local/pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  name: "local_conv2"
  type: "Convolution"
  bottom: "local/pool1"
  top: "local/conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
#    pad: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "local_relu2"
  type: "ReLU"
  bottom: "local/conv2"
  top: "local/conv2"
}
layer {
  name: "local_pool2"
  type: "Pooling"
  bottom: "local/conv2"
  top: "local/pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "local_conv3"
  type: "Convolution"
  bottom: "local/pool2"
  top: "local/conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "local_relu3"
  type: "ReLU"
  bottom: "local/conv3"
  top: "local/conv3"
}
layer {
  name: "local_conv4"
  type: "Convolution"
  bottom: "local/conv3"
  top: "local/conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "local_relu4"
  type: "ReLU"
  bottom: "local/conv4"
  top: "local/conv4"
}
layer {
  name: "local_conv5"
  type: "Convolution"
  bottom: "local/conv4"
  top: "local/conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "local_relu5"
  type: "ReLU"
  bottom: "local/conv5"
  top: "local/conv5"
}
layer {
  name: "local_pool3"
  type: "Pooling"
  bottom: "local/conv5"
  top: "local/pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 3
  }
}
layer {
  name: "local_fc6"
  type: "InnerProduct"
  bottom: "local/pool3"
  top: "local/fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "local_relu6"
  type: "ReLU"
  bottom: "local/fc6"
  top: "local/fc6"
}
layer {
  name: "local_drop6"
  type: "Dropout"
  bottom: "local/fc6"
  top: "local/fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "local_fc7"
  type: "InnerProduct"
  bottom: "local/fc6"
  top: "local/fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "local_relu7"
  type: "ReLU"
  bottom: "local/fc7"
  top: "local/fc7"
}
layer {
  name: "local_drop7"
  type: "Dropout"
  bottom: "local/fc7"
  top: "local/fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "local_68point"
  type: "InnerProduct"
  bottom: "local/fc7"
  top: "local/68point"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 136
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "local_loss"
  type: "EuclideanLoss"
  bottom: "local/68point"
  bottom: "local/label"
  #loss_weight:10
  top: "local/loss"
}





